app/controllers/appointments_controller.rb

  def show
    @appointment = person.appointments.find(params[:id])
---
SELECT * FROM "appointments" WHERE ("appointments"."id" = 1 AND ("appointments".patient_id = 1))

  def edit
    @appointment = person.appointments.find(params[:id])
---
SELECT * FROM "appointments" WHERE ("appointments"."id" = 1 AND ("appointments".patient_id = 1))

  def create
    @appointment = person.appointments.new(params[:appointment])
      respond_to do |format|
         if @appointment.save
---
INSERT INTO "appointments" ("created_at", "end_time", "arrive_date_time", "symptoms", "updated_at", "priority", "patient_id", "note", "doctor_id", "status", "start_time", "date_of_appointment") VALUES('2010-08-05 22:47:58', '2010-08-05 13:35:00', '2010-08-05 21:35:00', 'asda', '2010-08-05 22:47:58', 'sadas', 3, 'sdas', 1, 'sadas', '2010-08-05 11:35:00', '2012-03-10')

  def update
    @appointment = person.appointments.find(params[:id])
      respond_to do |format|
          if @appointment.update_attributes(params[:appointment])
---
SELECT * FROM "appointments" WHERE ("appointments"."id" = 4 AND ("appointments".patient_id = 3))
UPDATE "appointments" SET "start_time" = '2010-08-05 11:00:00', "updated_at" = '2010-08-05 20:45:03', "date_of_appointment" = '2010-08-07 00:00:00', "end_time" = '2010-08-05 12:00:00' WHERE "id" = 6

  def destroy
    @appointment = person.appointments.find(params[:id])
    @appointment.destroy
---
SELECT * FROM "appointments" WHERE ("appointments"."id" = 3 AND ("appointments".patient_id = 3))
DELETE FROM "appointments" WHERE "id" = 3