app/controllers/doctors_controller.rb

  def index
    @doctors = Doctor.all
---
SELECT * FROM "doctors"

  def show
    @doctor = Doctor.find(params[:id])
---
SELECT * FROM "doctors" WHERE ("doctors"."id" = 1)

  def create
    @doctor = Doctor.new(params[:doctor])

    respond_to do |format|
      if @doctor.save
---
INSERT INTO "doctors" ("name", "created_at", "updated_at", "room") VALUES('Markus Helfert', '2010-08-04 22:50:16', '2010-08-04 22:50:16', '214')