app/controllers/patients_controller.rb

  def index
    @patients = Patient.search(params[:search])
---
SELECT * FROM "patients" WHERE (f_name LIKE '%search%')

  def create
  #  @patient = Patient.new(params[:patient])
    respond_to do |format|
      if @patient.save
---
INSERT INTO "patients" ("m_name", "address", "next_of_kin", "blood_type", "occupation", "created_at", "updated_at", "f_name", "weight", "tel_number", "medical_history", "sex", "universal_ID", "mobile_number", "date_of_first_admission", "family_history", "height", "date_of_birth", "allergies", "bmi", "l_name", "current_medication", "email") VALUES('NA', '86 camac cresecet ', 'ross hamer', 'B postive', 'Student', '2010-07-28 17:33:50', '2010-07-28 17:33:50', 'Mo', 97.0, 857434111, 'bad heart burn', 'male', '3243252354353', 857434111, '2010-07-28', 'none', 6.2, '2005-08-23', 'none', 'NA', 'Aldeiri', 'none', 'asddsadasdasd')

  def update
 #   @patient = Patient.find(params[:id])
    respond_to do |format|
      if @patient.update_attributes(params[:patient])
---
UPDATE "patients" SET "current_medication" = '324', "updated_at" = '2010-07-30 15:25:59', "email" = '324', "mobile_number" = 324, "tel_number" = 324, "family_history" = '324', "date_of_first_admission" = '2005-07-30', "height" = 234.0, "m_name" = 'sdfs', "l_name" = 'dsf', "blood_type" = 'A+', "next_of_kin" = '234', "bmi" = '234', "date_of_birth" = '1992-07-30', "allergies" = '324', "universal_ID" = '324', "sex" = 'Male', "f_name" = 'Mo', "address" = '324', "medical_history" = 'sdf', "weight" = 324.0, "occupation" = '' WHERE "id" = 3

  def destroy
  #  @patient = Patient.find(params[:id])
    @patient.destroy
---
DELETE FROM "patients" WHERE "id" = 1