app/controllers/users_controller.rb

INSERT INTO "users" ("created_at", "crypted_password", "updated_at", "username", "admin", "password_salt", "persistence_token", "last_login_ip") VALUES('2010-07-31 15:33:17', 'f819d14e87f3cd12e211d14b45289278e361120cc33cfaba7e11bdbff397dc4cb970ac036ca6690b8397e491b96abffbbca383bc96b2579c083621c4fe598bc2', '2010-07-31 15:33:17', 'user', 'f', 'h2-gLkmyAYl5VyF5JFuH', 'bc5be2fd3b2c8c172fb03101e97f3349f8218ef410c4e137b9bc46b025519d58b0428b989933315cf22194b98872984161d01fb893032322e869e5213a8af737', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save