app/controllers/visits_controller.rb

  def show
    @visit = @patient.visits.find(params[:id])
---
SELECT * FROM "visits" WHERE ("visits"."id" = 2 AND ("visits".patient_id = 2))

  def create
    @visit = @patient.visits.build(params[:appointment])
    respond_to do |format|
      if @visit.save
---
INSERT INTO "visits" ("end_time", "created_at", "comments", "follow_up", "symptoms", "updated_at", "medication_perscribed", "final_diagnostics", "method_of_treatment", "visit_time", "patient_id", "provisional_diagnostics", "lab_test") VALUES('2010-07-30 19:46:00', '2010-07-30 15:47:12', 'sdf', 't', 'dfdsfsdf', '2010-07-30 15:47:12', 'sdf', 'sdf', 'sdf', '2010-09-30 15:50:00', 3, 'dsfsdf', 'sdfs')

  def destroy
    @visit = @patient.visits.find(params[:id])
    @visit.destroy
---
SELECT * FROM "visits" WHERE ("visits"."id" = 1 AND ("visits".patient_id = 3))
DELETE FROM "visits" WHERE "id" = 1